benchmark/experiment-1/10ms-tmaret-002-fibers-unbounded-250.txt
Running 25s test @ http://localhost:8080/sync?cpuIterations=1000&idleDelay=8&fileLength=1000
  250 threads and 250 connections
  Thread calibration: mean lat.: 1125.007ms, rate sampling interval: 4184ms
  Thread calibration: mean lat.: 811.628ms, rate sampling interval: 2699ms
  Thread calibration: mean lat.: 1143.362ms, rate sampling interval: 4427ms
  Thread calibration: mean lat.: 855.736ms, rate sampling interval: 2809ms
  Thread calibration: mean lat.: 1124.946ms, rate sampling interval: 4509ms
  Thread calibration: mean lat.: 846.877ms, rate sampling interval: 2815ms
  Thread calibration: mean lat.: 857.313ms, rate sampling interval: 2818ms
  Thread calibration: mean lat.: 1152.122ms, rate sampling interval: 4538ms
  Thread calibration: mean lat.: 844.543ms, rate sampling interval: 2793ms
  Thread calibration: mean lat.: 1129.420ms, rate sampling interval: 4259ms
  Thread calibration: mean lat.: 862.012ms, rate sampling interval: 2904ms
  Thread calibration: mean lat.: 1122.441ms, rate sampling interval: 4427ms
  Thread calibration: mean lat.: 1083.339ms, rate sampling interval: 4134ms
  Thread calibration: mean lat.: 1112.325ms, rate sampling interval: 4130ms
  Thread calibration: mean lat.: 834.303ms, rate sampling interval: 2715ms
  Thread calibration: mean lat.: 819.510ms, rate sampling interval: 2672ms
  Thread calibration: mean lat.: 1131.692ms, rate sampling interval: 4616ms
  Thread calibration: mean lat.: 889.518ms, rate sampling interval: 2938ms
  Thread calibration: mean lat.: 838.738ms, rate sampling interval: 2781ms
  Thread calibration: mean lat.: 1102.976ms, rate sampling interval: 4206ms
  Thread calibration: mean lat.: 1178.907ms, rate sampling interval: 4530ms
  Thread calibration: mean lat.: 798.711ms, rate sampling interval: 2666ms
  Thread calibration: mean lat.: 1110.367ms, rate sampling interval: 4243ms
  Thread calibration: mean lat.: 870.073ms, rate sampling interval: 2826ms
  Thread calibration: mean lat.: 842.802ms, rate sampling interval: 2709ms
  Thread calibration: mean lat.: 1130.063ms, rate sampling interval: 4517ms
  Thread calibration: mean lat.: 1016.218ms, rate sampling interval: 4157ms
  Thread calibration: mean lat.: 1095.501ms, rate sampling interval: 4188ms
  Thread calibration: mean lat.: 875.487ms, rate sampling interval: 2910ms
  Thread calibration: mean lat.: 855.195ms, rate sampling interval: 2789ms
  Thread calibration: mean lat.: 858.279ms, rate sampling interval: 2797ms
  Thread calibration: mean lat.: 1048.474ms, rate sampling interval: 3954ms
  Thread calibration: mean lat.: 930.789ms, rate sampling interval: 2953ms
  Thread calibration: mean lat.: 1164.978ms, rate sampling interval: 4308ms
  Thread calibration: mean lat.: 893.022ms, rate sampling interval: 2863ms
  Thread calibration: mean lat.: 839.737ms, rate sampling interval: 2762ms
  Thread calibration: mean lat.: 1217.567ms, rate sampling interval: 4583ms
  Thread calibration: mean lat.: 1192.187ms, rate sampling interval: 4431ms
  Thread calibration: mean lat.: 866.740ms, rate sampling interval: 2779ms
  Thread calibration: mean lat.: 1165.894ms, rate sampling interval: 4321ms
  Thread calibration: mean lat.: 895.742ms, rate sampling interval: 2908ms
  Thread calibration: mean lat.: 817.584ms, rate sampling interval: 2648ms
  Thread calibration: mean lat.: 1218.052ms, rate sampling interval: 4673ms
  Thread calibration: mean lat.: 1229.242ms, rate sampling interval: 4673ms
  Thread calibration: mean lat.: 852.627ms, rate sampling interval: 2783ms
  Thread calibration: mean lat.: 1185.260ms, rate sampling interval: 4300ms
  Thread calibration: mean lat.: 1223.038ms, rate sampling interval: 4550ms
  Thread calibration: mean lat.: 892.237ms, rate sampling interval: 2875ms
  Thread calibration: mean lat.: 914.497ms, rate sampling interval: 2920ms
  Thread calibration: mean lat.: 1221.456ms, rate sampling interval: 4665ms
  Thread calibration: mean lat.: 868.740ms, rate sampling interval: 2818ms
  Thread calibration: mean lat.: 1158.436ms, rate sampling interval: 4202ms
  Thread calibration: mean lat.: 879.525ms, rate sampling interval: 2799ms
  Thread calibration: mean lat.: 1186.310ms, rate sampling interval: 4419ms
  Thread calibration: mean lat.: 1231.224ms, rate sampling interval: 4542ms
  Thread calibration: mean lat.: 1223.093ms, rate sampling interval: 4546ms
  Thread calibration: mean lat.: 933.797ms, rate sampling interval: 2988ms
  Thread calibration: mean lat.: 801.565ms, rate sampling interval: 2633ms
  Thread calibration: mean lat.: 1175.605ms, rate sampling interval: 4317ms
  Thread calibration: mean lat.: 1240.717ms, rate sampling interval: 4472ms
  Thread calibration: mean lat.: 835.008ms, rate sampling interval: 2758ms
  Thread calibration: mean lat.: 1242.615ms, rate sampling interval: 4771ms
  Thread calibration: mean lat.: 852.366ms, rate sampling interval: 2652ms
  Thread calibration: mean lat.: 901.402ms, rate sampling interval: 2918ms
  Thread calibration: mean lat.: 911.732ms, rate sampling interval: 2887ms
  Thread calibration: mean lat.: 1328.223ms, rate sampling interval: 4857ms
  Thread calibration: mean lat.: 961.570ms, rate sampling interval: 2916ms
  Thread calibration: mean lat.: 1237.499ms, rate sampling interval: 4607ms
  Thread calibration: mean lat.: 1326.128ms, rate sampling interval: 5099ms
  Thread calibration: mean lat.: 950.677ms, rate sampling interval: 2967ms
  Thread calibration: mean lat.: 963.701ms, rate sampling interval: 2953ms
  Thread calibration: mean lat.: 1301.664ms, rate sampling interval: 4976ms
  Thread calibration: mean lat.: 968.984ms, rate sampling interval: 2983ms
  Thread calibration: mean lat.: 951.952ms, rate sampling interval: 3004ms
  Thread calibration: mean lat.: 1291.984ms, rate sampling interval: 4755ms
  Thread calibration: mean lat.: 880.381ms, rate sampling interval: 2721ms
  Thread calibration: mean lat.: 1284.891ms, rate sampling interval: 4849ms
  Thread calibration: mean lat.: 896.807ms, rate sampling interval: 2783ms
  Thread calibration: mean lat.: 1310.331ms, rate sampling interval: 4972ms
  Thread calibration: mean lat.: 1285.113ms, rate sampling interval: 4734ms
  Thread calibration: mean lat.: 898.758ms, rate sampling interval: 2789ms
  Thread calibration: mean lat.: 1290.296ms, rate sampling interval: 4653ms
  Thread calibration: mean lat.: 1293.849ms, rate sampling interval: 4902ms
  Thread calibration: mean lat.: 982.501ms, rate sampling interval: 2990ms
  Thread calibration: mean lat.: 954.727ms, rate sampling interval: 2971ms
  Thread calibration: mean lat.: 1264.904ms, rate sampling interval: 4665ms
  Thread calibration: mean lat.: 994.156ms, rate sampling interval: 2998ms
  Thread calibration: mean lat.: 1320.330ms, rate sampling interval: 4911ms
  Thread calibration: mean lat.: 990.093ms, rate sampling interval: 3055ms
  Thread calibration: mean lat.: 1264.125ms, rate sampling interval: 4538ms
  Thread calibration: mean lat.: 929.339ms, rate sampling interval: 2777ms
  Thread calibration: mean lat.: 1304.988ms, rate sampling interval: 4960ms
  Thread calibration: mean lat.: 961.411ms, rate sampling interval: 2902ms
  Thread calibration: mean lat.: 1278.865ms, rate sampling interval: 4706ms
  Thread calibration: mean lat.: 1312.240ms, rate sampling interval: 4947ms
  Thread calibration: mean lat.: 957.950ms, rate sampling interval: 2924ms
  Thread calibration: mean lat.: 1241.545ms, rate sampling interval: 4714ms
  Thread calibration: mean lat.: 920.937ms, rate sampling interval: 2832ms
  Thread calibration: mean lat.: 973.541ms, rate sampling interval: 3031ms
  Thread calibration: mean lat.: 1342.892ms, rate sampling interval: 5017ms
  Thread calibration: mean lat.: 945.486ms, rate sampling interval: 2957ms
  Thread calibration: mean lat.: 1280.621ms, rate sampling interval: 4952ms
  Thread calibration: mean lat.: 1015.114ms, rate sampling interval: 3108ms
  Thread calibration: mean lat.: 908.961ms, rate sampling interval: 2918ms
  Thread calibration: mean lat.: 1312.866ms, rate sampling interval: 4886ms
  Thread calibration: mean lat.: 1280.142ms, rate sampling interval: 4816ms
  Thread calibration: mean lat.: 924.033ms, rate sampling interval: 2834ms
  Thread calibration: mean lat.: 1315.005ms, rate sampling interval: 4935ms
  Thread calibration: mean lat.: 931.680ms, rate sampling interval: 2838ms
  Thread calibration: mean lat.: 1321.857ms, rate sampling interval: 4939ms
  Thread calibration: mean lat.: 956.249ms, rate sampling interval: 3039ms
  Thread calibration: mean lat.: 1293.566ms, rate sampling interval: 4755ms
  Thread calibration: mean lat.: 962.731ms, rate sampling interval: 2955ms
  Thread calibration: mean lat.: 896.111ms, rate sampling interval: 2830ms
  Thread calibration: mean lat.: 1266.295ms, rate sampling interval: 4714ms
  Thread calibration: mean lat.: 1019.492ms, rate sampling interval: 3166ms
  Thread calibration: mean lat.: 1315.074ms, rate sampling interval: 4993ms
  Thread calibration: mean lat.: 1281.965ms, rate sampling interval: 4919ms
  Thread calibration: mean lat.: 1302.630ms, rate sampling interval: 4747ms
  Thread calibration: mean lat.: 960.733ms, rate sampling interval: 2959ms
  Thread calibration: mean lat.: 1293.671ms, rate sampling interval: 4800ms
  Thread calibration: mean lat.: 918.248ms, rate sampling interval: 2797ms
  Thread calibration: mean lat.: 959.748ms, rate sampling interval: 3016ms
  Thread calibration: mean lat.: 1264.319ms, rate sampling interval: 4694ms
  Thread calibration: mean lat.: 1424.463ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 943.990ms, rate sampling interval: 2818ms
  Thread calibration: mean lat.: 1521.610ms, rate sampling interval: 5324ms
  Thread calibration: mean lat.: 1149.537ms, rate sampling interval: 3268ms
  Thread calibration: mean lat.: 1100.600ms, rate sampling interval: 3672ms
  Thread calibration: mean lat.: 1424.400ms, rate sampling interval: 5140ms
  Thread calibration: mean lat.: 1446.992ms, rate sampling interval: 5181ms
  Thread calibration: mean lat.: 1088.099ms, rate sampling interval: 3491ms
  Thread calibration: mean lat.: 1089.081ms, rate sampling interval: 3663ms
  Thread calibration: mean lat.: 1391.844ms, rate sampling interval: 4841ms
  Thread calibration: mean lat.: 1016.307ms, rate sampling interval: 3340ms
  Thread calibration: mean lat.: 1001.272ms, rate sampling interval: 3405ms
  Thread calibration: mean lat.: 1365.938ms, rate sampling interval: 4702ms
  Thread calibration: mean lat.: 1429.412ms, rate sampling interval: 5074ms
  Thread calibration: mean lat.: 1090.632ms, rate sampling interval: 3659ms
  Thread calibration: mean lat.: 941.101ms, rate sampling interval: 3272ms
  Thread calibration: mean lat.: 1412.886ms, rate sampling interval: 5070ms
  Thread calibration: mean lat.: 1326.948ms, rate sampling interval: 4710ms
  Thread calibration: mean lat.: 1043.239ms, rate sampling interval: 3528ms
  Thread calibration: mean lat.: 1419.640ms, rate sampling interval: 5042ms
  Thread calibration: mean lat.: 1415.897ms, rate sampling interval: 5083ms
  Thread calibration: mean lat.: 953.159ms, rate sampling interval: 3270ms
  Thread calibration: mean lat.: 996.595ms, rate sampling interval: 3264ms
  Thread calibration: mean lat.: 1366.607ms, rate sampling interval: 4890ms
  Thread calibration: mean lat.: 1054.503ms, rate sampling interval: 3399ms
  Thread calibration: mean lat.: 1329.973ms, rate sampling interval: 4702ms
  Thread calibration: mean lat.: 1048.026ms, rate sampling interval: 3457ms
  Thread calibration: mean lat.: 959.989ms, rate sampling interval: 3133ms
  Thread calibration: mean lat.: 1420.203ms, rate sampling interval: 5050ms
  Thread calibration: mean lat.: 1427.582ms, rate sampling interval: 5152ms
  Thread calibration: mean lat.: 1002.263ms, rate sampling interval: 3268ms
  Thread calibration: mean lat.: 1436.875ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1380.776ms, rate sampling interval: 4775ms
  Thread calibration: mean lat.: 1009.436ms, rate sampling interval: 3379ms
  Thread calibration: mean lat.: 1067.627ms, rate sampling interval: 3506ms
  Thread calibration: mean lat.: 1341.482ms, rate sampling interval: 4685ms
  Thread calibration: mean lat.: 1002.835ms, rate sampling interval: 3379ms
  Thread calibration: mean lat.: 1334.951ms, rate sampling interval: 4812ms
  Thread calibration: mean lat.: 1017.900ms, rate sampling interval: 3493ms
  Thread calibration: mean lat.: 998.200ms, rate sampling interval: 3373ms
  Thread calibration: mean lat.: 1305.352ms, rate sampling interval: 4677ms
  Thread calibration: mean lat.: 1442.189ms, rate sampling interval: 5214ms
  Thread calibration: mean lat.: 1055.893ms, rate sampling interval: 3618ms
  Thread calibration: mean lat.: 1406.224ms, rate sampling interval: 5210ms
  Thread calibration: mean lat.: 1066.133ms, rate sampling interval: 3608ms
  Thread calibration: mean lat.: 1358.904ms, rate sampling interval: 4911ms
  Thread calibration: mean lat.: 1396.195ms, rate sampling interval: 4980ms
  Thread calibration: mean lat.: 1030.566ms, rate sampling interval: 3411ms
  Thread calibration: mean lat.: 986.194ms, rate sampling interval: 3356ms
  Thread calibration: mean lat.: 1378.155ms, rate sampling interval: 4771ms
  Thread calibration: mean lat.: 1411.978ms, rate sampling interval: 4960ms
  Thread calibration: mean lat.: 1015.695ms, rate sampling interval: 3338ms
  Thread calibration: mean lat.: 1130.607ms, rate sampling interval: 3708ms
  Thread calibration: mean lat.: 1420.307ms, rate sampling interval: 4952ms
  Thread calibration: mean lat.: 894.410ms, rate sampling interval: 2998ms
  Thread calibration: mean lat.: 1125.153ms, rate sampling interval: 3708ms
  Thread calibration: mean lat.: 1339.555ms, rate sampling interval: 4747ms
  Thread calibration: mean lat.: 1010.261ms, rate sampling interval: 3225ms
  Thread calibration: mean lat.: 1470.762ms, rate sampling interval: 5283ms
  Thread calibration: mean lat.: 1042.963ms, rate sampling interval: 3448ms
  Thread calibration: mean lat.: 1402.572ms, rate sampling interval: 4993ms
  Thread calibration: mean lat.: 997.280ms, rate sampling interval: 3348ms
  Thread calibration: mean lat.: 1421.580ms, rate sampling interval: 4886ms
  Thread calibration: mean lat.: 1042.814ms, rate sampling interval: 3465ms
  Thread calibration: mean lat.: 1434.266ms, rate sampling interval: 5128ms
  Thread calibration: mean lat.: 1404.202ms, rate sampling interval: 5087ms
  Thread calibration: mean lat.: 1420.631ms, rate sampling interval: 4980ms
  Thread calibration: mean lat.: 1048.175ms, rate sampling interval: 3594ms
  Thread calibration: mean lat.: 1049.810ms, rate sampling interval: 3467ms
  Thread calibration: mean lat.: 1022.242ms, rate sampling interval: 3553ms
  Thread calibration: mean lat.: 1382.300ms, rate sampling interval: 4890ms
  Thread calibration: mean lat.: 1432.045ms, rate sampling interval: 5271ms
  Thread calibration: mean lat.: 1096.449ms, rate sampling interval: 3551ms
  Thread calibration: mean lat.: 1054.403ms, rate sampling interval: 3397ms
  Thread calibration: mean lat.: 1433.280ms, rate sampling interval: 5087ms
  Thread calibration: mean lat.: 1044.377ms, rate sampling interval: 3401ms
  Thread calibration: mean lat.: 1464.454ms, rate sampling interval: 5246ms
  Thread calibration: mean lat.: 1497.389ms, rate sampling interval: 5242ms
  Thread calibration: mean lat.: 1101.654ms, rate sampling interval: 3624ms
  Thread calibration: mean lat.: 1430.125ms, rate sampling interval: 5074ms
  Thread calibration: mean lat.: 1000.564ms, rate sampling interval: 3373ms
  Thread calibration: mean lat.: 1447.500ms, rate sampling interval: 5062ms
  Thread calibration: mean lat.: 1331.688ms, rate sampling interval: 4542ms
  Thread calibration: mean lat.: 1104.161ms, rate sampling interval: 3620ms
  Thread calibration: mean lat.: 1077.087ms, rate sampling interval: 3481ms
  Thread calibration: mean lat.: 1096.541ms, rate sampling interval: 3520ms
  Thread calibration: mean lat.: 1500.200ms, rate sampling interval: 5353ms
  Thread calibration: mean lat.: 1384.928ms, rate sampling interval: 5046ms
  Thread calibration: mean lat.: 1093.703ms, rate sampling interval: 3610ms
  Thread calibration: mean lat.: 1082.556ms, rate sampling interval: 3608ms
  Thread calibration: mean lat.: 1328.229ms, rate sampling interval: 4644ms
  Thread calibration: mean lat.: 1481.005ms, rate sampling interval: 5332ms
  Thread calibration: mean lat.: 1394.407ms, rate sampling interval: 4890ms
  Thread calibration: mean lat.: 1136.086ms, rate sampling interval: 3680ms
  Thread calibration: mean lat.: 1101.160ms, rate sampling interval: 3563ms
  Thread calibration: mean lat.: 1465.317ms, rate sampling interval: 5328ms
  Thread calibration: mean lat.: 1482.044ms, rate sampling interval: 5111ms
  Thread calibration: mean lat.: 1083.776ms, rate sampling interval: 3614ms
  Thread calibration: mean lat.: 1080.243ms, rate sampling interval: 3586ms
  Thread calibration: mean lat.: 1375.904ms, rate sampling interval: 4755ms
  Thread calibration: mean lat.: 1070.023ms, rate sampling interval: 3481ms
  Thread calibration: mean lat.: 1416.502ms, rate sampling interval: 5070ms
  Thread calibration: mean lat.: 1097.124ms, rate sampling interval: 3586ms
  Thread calibration: mean lat.: 1057.899ms, rate sampling interval: 3454ms
  Thread calibration: mean lat.: 1466.225ms, rate sampling interval: 5234ms
  Thread calibration: mean lat.: 1310.886ms, rate sampling interval: 4497ms
  Thread calibration: mean lat.: 1482.609ms, rate sampling interval: 5193ms
  Thread calibration: mean lat.: 1134.486ms, rate sampling interval: 3674ms
  Thread calibration: mean lat.: 1058.574ms, rate sampling interval: 3450ms
  Thread calibration: mean lat.: 1419.886ms, rate sampling interval: 5033ms
  Thread calibration: mean lat.: 1051.127ms, rate sampling interval: 3457ms
  Thread calibration: mean lat.: 1447.709ms, rate sampling interval: 5177ms
  Thread calibration: mean lat.: 1102.722ms, rate sampling interval: 3485ms
  Thread calibration: mean lat.: 1426.285ms, rate sampling interval: 5038ms
  Thread calibration: mean lat.: 1436.874ms, rate sampling interval: 5017ms
  Thread calibration: mean lat.: 1137.030ms, rate sampling interval: 3719ms
  Thread calibration: mean lat.: 1532.831ms, rate sampling interval: 5419ms
  Thread calibration: mean lat.: 1006.333ms, rate sampling interval: 3205ms
  Thread calibration: mean lat.: 1057.181ms, rate sampling interval: 3530ms
  Thread calibration: mean lat.: 1443.198ms, rate sampling interval: 4902ms
  Thread calibration: mean lat.: 1055.897ms, rate sampling interval: 3553ms
  Thread calibration: mean lat.: 1462.364ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 1472.872ms, rate sampling interval: 5292ms
  Thread calibration: mean lat.: 1059.167ms, rate sampling interval: 3424ms
  Thread calibration: mean lat.: 1152.386ms, rate sampling interval: 3827ms
  Thread calibration: mean lat.: 1402.142ms, rate sampling interval: 4907ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.53s     1.14s    6.44s    64.77%
    Req/Sec    12.71      1.14    15.00     94.40%
  78688 requests in 24.05s, 93.43MB read
Requests/sec:   3271.57
Transfer/sec:      3.88MB